rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/i2c.c
   /* Clear any pending flags on RX Stream */
   DMA_ClearFlag(
         s_I2C_Bus[iBus].i2c_dma_tx_stream,
         s_I2C_Bus[iBus].i2c_dma_tx_flags
   );

   /* I2Cx DMA Enable */
   I2C_DMACmd( s_I2C_Bus[iBus].i2c_bus, ENABLE );

   /* Finally, activate DMA */
   DMA_Cmd( s_I2C_Bus[iBus].i2c_dma_tx_stream, ENABLE );
}


/******************************************************************************/
inline void I2C1_DMAReadCallback( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */
//   isr_dbg_slow_printf("\n\n DMA!!!\n\n");
   /* Test on DMA Stream Transfer Complete interrupt */
   if ( RESET != DMA_GetITStatus(DMA1_Stream0, DMA_IT_TCIF0) ) {
      DMA_Cmd( DMA1_Stream0, DISABLE );

      I2C_GenerateSTOP(I2C1, ENABLE);                        /* Generate Stop */

      /* Publish event with the read data */
      I2CDataEvt *i2cDataEvt = Q_NEW( I2CDataEvt, I2C_READ_DONE_SIG );
      i2cDataEvt->i2cDevice = s_I2C_Bus[I2CBus1].i2c_cur_dev;
      i2cDataEvt->wDataLen = s_I2C_Bus[I2CBus1].nBytesExpected;
      MEMCPY(
            i2cDataEvt->bufData,
            s_I2C_Bus[I2CBus1].pRxBuffer,
            i2cDataEvt->wDataLen
      );
      QF_PUBLISH( (QEvent *)i2cDataEvt, AO_I2CMgr );

      /* Clear DMA Stream Transfer Complete interrupt pending bit */
      DMA_ClearITPendingBit( DMA1_Stream0, DMA_IT_TCIF0 );
   }

   QK_ISR_EXIT();                           /* inform QK about exiting an ISR */
}

/******************************************************************************/
inline void I2C1_DMAWriteCallback( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */
//   isr_dbg_slow_printf("\n\n DMA!!!\n\n");
   /* Test on DMA Stream Transfer Complete interrupt */
   if ( RESET != DMA_GetITStatus(DMA1_Stream6, DMA_IT_TCIF6) ) {
      DMA_Cmd( DMA1_Stream6, DISABLE );

      I2C_GenerateSTOP(I2C1, ENABLE);                        /* Generate Stop */

      /* Publish event with the read data */
      I2CEvt *i2cEvt = Q_NEW( I2CEvt, I2C_WRITE_DONE_SIG );
      i2cEvt->i2cDevice = s_I2C_Bus[I2CBus1].i2c_cur_dev;
      i2cEvt->wDataLen = s_I2C_Bus[I2CBus1].nBytesExpected;
      QF_PUBLISH( (QEvent *)i2cEvt, AO_I2CMgr );

      /* Clear DMA Stream Transfer Complete interrupt pending bit */
      DMA_ClearITPendingBit( DMA1_Stream6, DMA_IT_TCIF6 );
   }

   QK_ISR_EXIT();                           /* inform QK about exiting an ISR */
}

/******************************************************************************/
inline void I2C1_EventCallback( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */

   /* Get Last I2C Event */
   __IO uint32_t I2CEvent = I2C_GetLastEvent( I2C1 );

   /* Check which I2C device on this bus is being used */
   //   if ( EEPROM == s_I2C_Bus[I2CBus1].i2c_cur_dev ) {
   switch (I2CEvent) {
      //      case 0x00000000:
      //      case 0x00000001:
      //      case 0x00004001:
      //      case 0x00034044:
      //         /* This is the I2C "Event" that is always triggering so we explicitly
      //          * ignore it here */
      //         break;

      case I2C_EVENT_MASTER_MODE_SELECT: /* BUSY, MSL and SB flag */

         if ( I2C_GEN_START_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {
            /* Set new state */
            s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_MASTER_TX_MODE_SELECTED_ST;

            isr_dbg_slow_printf("Selecting master\n");
//            DBG_printf("Selecting master\n");
            /* Send slave Address for write */
            I2C_Send7bitAddress(
                  I2C1,                                  // This is always the bus used in this ISR
                  s_I2C_Bus[I2CBus1].i2c_cur_dev_addr,   // Look up the current device address for this bus
                  s_I2C_Bus[I2CBus1].bTransDirection     // Direction of data on this bus
            );
         } else if ( I2C_GEN_2ND_START_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {

            /* Set the direction to receive */
            I2C_SetDirection( I2CBus1,  I2C_Direction_Receiver);

            /* Send slave Address for read */
            I2C_Send7bitAddress(
                  I2C1,           /* This is always the bus used in this ISR */
                  s_I2C_Bus[I2CBus1].i2c_cur_dev_addr,  /* Look up the current device address for this bus */
                  s_I2C_Bus[I2CBus1].bTransDirection    /* Direction of data on this bus */
            );

            isr_dbg_slow_printf("Selecting master again\n");

//            DBG_printf("Selecting master again\n");
         }

         /* Create and publish event for I2CMgr */
//         QEvt *qEvt = Q_NEW( QEvt, I2C_EV_MASTER_MODE_SELECT_SIG );
//         QF_PUBLISH( (QEvt *)qEvt, AO_I2CMgr );

//         isr_dbg_slow_printf("I2C_EVENT_MASTER_MODE_SELECT\n");
         break;

      case I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED:
         isr_dbg_slow_printf("I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED\n");
//         DBG_printf("I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED\n");
         break;

      /* Check on EV6 */
      case I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED: /* BUSY, MSL, ADDR, TXE and TRA flags */
         isr_dbg_slow_printf("I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED\n");
//         DBG_printf("I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED\n");
         if ( I2C_MASTER_TX_MODE_SELECTED_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {

            /* 2 byte address for device */
            if ( 2 == I2C_getDevAddrSize(s_I2C_Bus[I2CBus1].i2c_cur_dev) ) {
            isr_dbg_slow_printf("MSB\n");

               /* Set new state */
               s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_SENT_MSB_ADDR_ST;

               /* Create and publish event for I2CMgr */
//            QEvt *qEvt1 = Q_NEW( QEvt, I2C_EV_MASTER_TX_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt1, AO_I2CMgr );

               /* Send the MSB of the address first to the I2C device */
               I2C_SendData(
                     I2C1,
                     (uint8_t)((s_I2C_Bus[I2CBus1].i2c_cur_dev_addr & 0xFF00) >> 8)
               );
            } else { /* Single byte address for device */
               isr_dbg_slow_printf("Single byte address\n");
               /* Set new state and use the LSB state so we can skip to the next
                * step */
               s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_SENT_LSB_ADDR_ST;

               /* Create and publish event for I2CMgr */
//            QEvt *qEvt1 = Q_NEW( QEvt, I2C_EV_MASTER_TX_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt1, AO_I2CMgr );

               /* Send the entire 1 byte address to the I2C device */
               I2C_SendData(
                     I2C1,
                     (uint8_t)((s_I2C_Bus[I2CBus1].i2c_cur_dev_addr & 0x00FF))
               );
            }

//            I2C_GetITStatus()
//            I2C_GetFlagStatus( I2C1, I2C_FLAG_MSL | I2C_FLAG_ADDR | I2C_FLAG_TXE | I2C_FLAG_TRA );
//            isr_dbg_slow_printf("I2C (before) MSL: %x, ADDR: %x, TXE: %x, TRA: %x\n",
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_MSL),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_ADDR),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TXE),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TRA)
//            );
//            I2C_SendData(I2C1, (uint8_t)((0x0000 & 0xFF00) >> 8));
//
//            isr_dbg_slow_printf("I2C (after) MSL: %x, ADDR: %x, TXE: %x, TRA: %x\n",
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_MSL),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_ADDR),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TXE),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TRA)
//            );
//
//            /*!< Test on EV8 and clear it */
//            uint16_t sEETimeout = 10000;
//            while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
////            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr msb\n");
//                  break;
//               }
//            }
//
//            /*!< Send the EEPROM's internal address to read from: LSB of the address */
//            I2C_SendData(I2C1, (uint8_t)(0x0000 & 0x00FF));
//            sEETimeout = 10000;
//            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr lsb\n");
//                  break;
//               }
//            }
//            isr_dbg_slow_printf("Sent addr\n");
         }



//            /*!< Send the EEPROM's internal address to read from: MSB of the address first */
//            I2C_SendData(I2C1, (uint8_t)((0x0000 & 0xFF00) >> 8));
//
//            /*!< Test on EV8 and clear it */
//            uint16_t sEETimeout = 10000;
//            while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr msb\n");
//               }
//            }
//
//            /*!< Send the EEPROM's internal address to read from: LSB of the address */
//            I2C_SendData(I2C1, (uint8_t)(0x0000 & 0x00FF));
//            sEETimeout = 10000;
//            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr lsb\n");
//               }
//            }
//            isr_dbg_slow_printf("Sent addr\n");
/* Create and publish event for I2CMgr */
//            QEvt *qEvt = Q_NEW( QEvt, I2C_MSTR_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt, AO_I2CMgr );
         break;

         /* Check on EV8 */
      case I2C_EVENT_MASTER_BYTE_TRANSMITTING:
//         isr_dbg_slow_printf("I2C_EVENT_MASTER_BYTE_TRANSMITTING\n");
         break;

